In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
df = sns.load_dataset("mpg")

In [4]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [6]:
df.isna().sum() # La funcion .isna() nos especifica que campos son nulos y cuales no, al agregar .sum()
                # nos muestra de manera contable cuantos de nustros campos son nulos.

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

In [10]:
(df.isna().sum() / df.shape[0])*100 #Porcentaje de valores nulos.

mpg             0.0
cylinders       0.0
displacement    0.0
horsepower      0.0
weight          0.0
acceleration    0.0
model_year      0.0
origin          0.0
name            0.0
dtype: float64

Tratment of null values

In [8]:
### fillNA

In [9]:
df['horsepower'].fillna(df['horsepower'].median(), inplace = True)

#En este caso se reemplazan los valores nullos con la mediana, inplace = True implica que el cambio sera permanente en la
#df que llamamos.

In [15]:
### dropNA

In [16]:
df1 = sns.load_dataset("titanic")

In [17]:
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
df1.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [29]:
df1.dropna(how = 'any', axis = 0).shape #Drop rows with at least one null value

(182, 15)

In [33]:
df1.dropna(how = 'any', axis = 1).shape #Drop columns with at least one null value

(891, 11)

In [31]:
df1.dropna(how = 'all', axis = 0).shape #Drop rows if all values are null

(891, 15)

In [32]:
df1.dropna(how = 'all', axis = 1).shape #Drop columns if all values are null

(891, 15)

In [34]:
df1.shape

(891, 15)